docs/definizioni.html
<!doctype html>
<html lang="en">
<head>
<title>Definizioni generali sui grafi</title>
<!-- 2022-05-08 Sun 10:35 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Cammino</a></li>
<li><a href="#sec-2">2. Componente connessa</a></li>
<li><a href="#sec-3">3. Completezza di un grafo</a></li>
<li><a href="#sec-4">4. Densità di un grafo</a></li>
<li><a href="#sec-5">5. Foresta</a></li>
<li><a href="#sec-6">6. Grado di un vertice</a></li>
<li><a href="#sec-7">7. Lemma della stretta di mano</a></li>
<li><a href="#sec-8">8. Grafo regolare</a></li>
<li><a href="#sec-9">9. Isomorfismo di grafi ?!?!?!</a></li>
<li><a href="#sec-10">10. Clique</a></li>
<li><a href="#sec-11">11. Proprietà dei grafi connessi/aciclici</a></li>
<li><a href="#sec-12">12. Teorema degli alberi</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Definizioni generali sui grafi</h1>
<p>
Dati G = (V,E) dove G è un grafo, V è l&rsquo;insieme dei nodi ed E è l&rsquo;insieme degli archi:
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cammino</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Un cammino corrisponde al <b>numero di archi</b> interposti tra un nodo sorgente e un nodo destinazione.
<br>
Un cammino è detto <b>semplice</b> quando tutti i vertici sono distinti.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Componente connessa</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
Una componente connessa è un sottoinsieme del grafo in cui tutti i nodi risultano <b>raggiungibili</b>
<br>
(essa può corrispondere al grafo stesso)
<br>
Non esiste un sottografo connesso più grande della componente connessa
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Completezza di un grafo</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<ol class="org-ol">
<li><b>Vuoto</b> se E è un insieme vuoto
</li>
<li><b>Completo</b> se E = VxV
</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Densità di un grafo</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<ol class="org-ol">
<li>Se G è <b>non orientato</b>, allora <b>δ(G) = |E| / (numero di archi possibili)</b>
</li>
<li>Se G è <b>orientato</b>, <b>δ(G) = |E| / |V|<sup>2</sup></b>
</li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Foresta</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
Una foresta è un grafo <b>connesso e aciclico</b>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Grado di un vertice</h2>
<div class="outline-text-2" id="text-6">
<blockquote>
<p>
Il grado di un vertice (deg(u)) corrisponde al numero di vertici adiacenti ad esso (in un grafo non orientato).
<br>
Vale la seguente proprietà: <b>0 &lt;= deg(u) &lt;= n - 1</b>
<br>
<b>Non è possibile creare un grafo in cui tutti i gradi dei vertici sono distinti</b>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Lemma della stretta di mano</h2>
<div class="outline-text-2" id="text-7">
<blockquote>
<p>
Dati n = |V| e m = |E|, si ha che:
<br>
<b>La somma dei gradi di tutti i vertici di un grafo non orientato è pari a 2m</b>
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Grafo regolare</h2>
<div class="outline-text-2" id="text-8">
<blockquote>
<p>
Un grafo non orientato si dice <b>regolare</b> quando, dato un numero intero <b>k</b>, il grado di tutti i vertici è pari a k.
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Isomorfismo di grafi ?!?!?!</h2>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Clique</h2>
<div class="outline-text-2" id="text-10">
<blockquote>
<p>
Una Clique è un sottoinsieme di un grafo (indicato con C) non orientato tale che <b>G[C] è completo.</b>
<br>
Una clique può essere <b>massimale</b> se, dati certi vertici non si riesce ad estendere la clique ulteriormente;
<br>
Altrimenti può essere <b>massima</b> quando non esiste una clique più grande all&rsquo;interno del grafo (viene escluso il grafo stesso).
</p>
</blockquote>
</div>
</div>


<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Proprietà dei grafi connessi/aciclici</h2>
<div class="outline-text-2" id="text-11">
<blockquote>
<p>
Se un grafo non orientato è connesso, allora <b>|E| = |V| - 1</b>.
<br>
Se invece il grafo è aciclico, allora <b>|E| &lt;= |V| - 1</b>.
</p>
</blockquote>
</div>
</div>


<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Teorema degli alberi</h2>
<div class="outline-text-2" id="text-12">
<blockquote>
<ol class="org-ol">
<li>G è un albero
</li>
<li>Due vertici qualsiasi di G sono connessi da un unico cammino
</li>
<li>G è connesso, ma se qualunque arco viene rimosso da G, il grafo risultante è disconnesso
</li>
<li>G è connesso e aciclico -&gt; |E| = |V| - 1
</li>
<li>G è aciclico, ma aggiungendo un qualsiasi arco a G, il grafo risultante è ciclico
</li>
</ol>
</blockquote>

<p>
<a href="../index.html">HOME</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2022-05-08 Sun 10:35</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
